In [1]:
import pandas

Save the ready pandas dataframe in a file so that next time we don't need to collect data from a database or a rest api

In [2]:
url="http://sohamspring.azurewebsites.net/api/orders/all"
df=pandas.read_json(url)
print(df)

                   custnm        city    prodnm        company     price
0            Boris Becker      berlin     Amaze          Honda    665000
1      Sylvester Stallone     Kolkata    Baleno  Maruti Suzuki    642000
2           Roger Federer   amsterdam      City          Honda    950000
3               Alia Bhat     lucknow     Creta        Hyundai   1044000
4              A R Rahman     chennai     Creta        Hyundai   1044000
5   Arnold Schwarzenegger  los angles  Fortuner         Toyota   3258000
6            Keanu Reeves       tokyo  Fortuner         Toyota   3258000
7              Imran Khan      lahore  Fortuner         Toyota   3258000
8            Dipika Singh      mumbai    Innova         Toyota   1809000
9        Sabastian Vettel  heppenheim    Kodiaq          Skoda   3749000
10               Joe Root      london    Kushaq          Skoda   1158000
11         Shah Rukh Khan   new delhi    Safari           Tata   1545000
12          Anne Hathaway        Agra     Swift  Maruti Suzuki    591000
13            Emily Blunt      london    Taigun     Volkswagen   1256000
14                   Tabu   hyderabad    Tiguan     Volkswagen   3375000
15            Jos Buttler  manchester    Tiguan     Volkswagen   3375000
16                  Rekha     chennai     Venue        Hyundai    753000
17            Steffi Graf   stuttgart    Virtus     Volkswagen   1132000
18             Tom Cruise     chicago        XM            BMW  12500000
19     Michael Schumacher      berlin        XM            BMW  12500000

In [3]:
df.to_pickle("orders")
print('pandas data is stored in a file for future use')

pandas data is stored in a file for future use